

/*
 * 给定一个整数 n ，判断是否为 4 的 x 次幂
 * 
 * 4:     0000 0000 0000 0100  => 只有第 3  位为 1
 * 16:    0000 0000 0001 0000  => 只有第 5  位为 1
 * 64:    0000 0000 0100 0000  => 只有第 7  位为 1
 * 256:   0000 0001 0000 0000  => 只有第 9  位为 1
 * 1024:  0000 0100 0000 0000  => 只有第 11 位为 1
 * 4096:  0001 0000 0000 0000  => 只有第 13 位为 1
 */
class Solution {
public:
    bool isPowerOfFour(int n) {
        for (int i = 0; i < 32; i = i + 2) {
            if ((1 << i) == n) return true;
            else if ((1 << i) > n) return false;
        }
        return false;
    }
};